; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_3 ?v5 - type_2 ?v2 - type_3)
 	      (pred_4 ?v6 - object ?v2 - type_3)
	      (pred_1 ?v5 - type_2 ?v4 - type_1)
	      (pred_2 ?v5 - type_2 ?v6 - object ?v4 - type_1))

   (:action op_2
       :parameters  (?v5 - type_2 ?v8 ?v3 - type_3)
       :precondition (and  (pred_3 ?v5 ?v8))
       :effect (and  (pred_3 ?v5 ?v3)
		     (not (pred_3 ?v5 ?v8))))

   (:action op_1
       :parameters (?v5 - type_2 ?v7 - object ?v1 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v1) (pred_3 ?v5 ?v1) (pred_1 ?v5 ?v4))
       :effect (and (pred_2 ?v5 ?v7 ?v4)
		    (not (pred_4 ?v7 ?v1)) 
		    (not (pred_1 ?v5 ?v4))))

   (:action op_3
       :parameters (?v5 - type_2 ?v7 - object ?v1 - type_3 ?v4 - type_1)
       :precondition  (and  (pred_2 ?v5 ?v7 ?v4) (pred_3 ?v5 ?v1))
       :effect (and (pred_4 ?v7 ?v1)
		    (pred_1 ?v5 ?v4)
		    (not (pred_2 ?v5 ?v7 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_09 obj_02 - type_2
obj_04 obj_05 obj_07 obj_01 - type_1
obj_12 obj_14 obj_13 obj_11 - type_3
obj_03 obj_06 obj_08 obj_10 - object)
(:init
(pred_3 obj_09 obj_14)
(pred_1 obj_09 obj_04)
(pred_1 obj_09 obj_05)
(pred_3 obj_02 obj_11)
(pred_1 obj_02 obj_07)
(pred_1 obj_02 obj_01)
(pred_4 obj_03 obj_11)
(pred_4 obj_06 obj_11)
(pred_4 obj_08 obj_12)
(pred_4 obj_10 obj_13)
)
(:goal
(and
(pred_4 obj_03 obj_11)
(pred_4 obj_06 obj_13)
(pred_4 obj_08 obj_12)
(pred_4 obj_10 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_09 obj_13) (pred_3 obj_02 obj_13))))
  )
)
)

; plan
1. (op_1 obj_02 obj_06 obj_11 obj_01)
   deleted: (pred_4 obj_06 obj_11) (pred_1 obj_02 obj_01)
   added: (pred_2 obj_02 obj_06 obj_01)
   goals met: 2 of 4
2. (op_2 obj_09 obj_14 obj_12)
   deleted: (pred_3 obj_09 obj_14)
   added: (pred_3 obj_09 obj_12)
   goals met: 2 of 4
3. (op_2 obj_02 obj_11 obj_13)
   deleted: (pred_3 obj_02 obj_11)
   added: (pred_3 obj_02 obj_13)
   goals met: 2 of 4
4. (op_3 obj_02 obj_06 obj_13 obj_01)
   deleted: (pred_2 obj_02 obj_06 obj_01)
   added: (pred_4 obj_06 obj_13) (pred_1 obj_02 obj_01)
   goals met: 3 of 4
5. (op_1 obj_02 obj_10 obj_13 obj_07)
   deleted: (pred_4 obj_10 obj_13) (pred_1 obj_02 obj_07)
   added: (pred_2 obj_02 obj_10 obj_07)
   goals met: 3 of 4
6. (op_2 obj_02 obj_13 obj_12)
   deleted: (pred_3 obj_02 obj_13)
   added: (pred_3 obj_02 obj_12)
   goals met: 3 of 4
7. (op_3 obj_02 obj_10 obj_12 obj_07)
   deleted: (pred_2 obj_02 obj_10 obj_07)
   added: (pred_4 obj_10 obj_12) (pred_1 obj_02 obj_07)
   goals met: 4 of 4
